{
	"title": "سياسة الخصوصية",
	"version": "الإصدار 1.0 - 2025 (الإصدار الأول)",
	"introduction": {
		"title": "مقدمة",
		"content": "مرحباً بكم في منصة GovGPT. إن منصة GovGPT هي منصة تابعة لدائرة التمكين الحكومي، يتم تشغيلها بمقتضى تفويض من حكومة أبوظبي، وهي مصممة لتسهيل مشاركة البيانات والتعاون بين الجهات الحكومية في أبوظبي. يقتصر الوصول إلى هذه المنصة على الموظفين الحكوميين المصرح لهم وتدعم العمليات اليومية وتقديم الخدمات ومبادرات التمكين الرقمي في حكومة أبوظبي."
	},
	"what_we_collect": {
		"title": "ما هي المعلومات التي نجمعها",
		"content": "تجمع GovGPT بيانات المستخدم اللازمة للمصادقة والترخيص والتبادل الآمن للبيانات وتعالجها. تتضمن البيانات التي يتم جمعها ما يلي: المعلومات الشخصية (التي يتم جمعها من خلال الدخول الموحد للمؤسسة): الاسم، والبريد الإلكتروني للعمل، والمسمى الوظيفي، والقسم. المعلومات التقنية: الويب: نوع/إصدار المتصفح، ونظام التشغيل، ودقة الشاشة، وعنوان IP، والمنطقة. الجوال: طراز/نظام تشغيل الجهاز، معرّف الجهاز (على سبيل المثال، معرّف الجهاز UDID)، رمز إعلان الدفع (يتحكم المستخدم في إعدادات الجهاز). معلومات الاستخدام: مشاهدات الصفحة، واستعلامات البحث، ومكالمات واجهة برمجة التطبيقات، ومحاولات تسجيل الدخول المختومة بالوقت، وأحداث سجل التدقيق. البيانات الوصفية: مطالب المستخدم، والملفات التي تم تحميلها طوعاً، واستجابات النماذج (يتم تسجيلها فقط للتدقيق الأمني واكتشاف التحيز وتحسين الجودة - وليس لأغراض تجارية). المعلومات غير الشخصية: إحصائيات مجمعة لا يمكن استخدامها لتحديد هوية المستخدمين الأفراد."
	},
	"how_we_collect": {
		"title": "كيف نجمع المعلومات",
		"content": "نجمع المعلومات من خلال طريقتين: المعلومات التي تقدمها مباشرةً: عند استخدام خدماتنا، قد تقوم بمشاركة المعلومات معنا، كما هو الحال عند تسجيل الدخول أو إرسال استعلام. المعلومات التي يتم جمعها تلقائياً: يتم جمع بعض البيانات تلقائياً أثناء استخدامك لخدماتنا، بما في ذلك تفاصيل حول أنماط استخدامك وعنوان IP ومعلومات الجهاز."
	},
	"how_we_use": {
		"title": "كيف نستخدم المعلومات",
		"content": "تُستخدم هذه البيانات حصرياً من أجل: ضمان أمن المنصة والمصادقة على المستخدمين المصرح لهم. مراقبة صحة النظام وتحسين الأداء العام. فرض سياسات الوصول إلى البيانات ولوائح الحوكمة. تقديم الخدمات التي يطلبها المستخدم (على سبيل المثال، استجابات الدردشة ومعالجة المستندات). تحسين وظائف GovGPT عبر تحليلات مجمّعة ومجهولة المصدر. الوفاء بالالتزامات القانونية والتنظيمية والتزامات الامتثال والتدقيق التي تنطبق على الجهات الحكومية في حكومة أبوظبي بمقتضى تفويض دائرة حكومة أبوظبي."
	},
	"how_we_protect": {
		"title": "كيف نحمي المعلومات",
		"content": "تستخدم GovGPT تدابير أمنية رائدة في المجال لحماية بيانات المستخدم، بما في ذلك: الدخول الأحادي للمؤسسة (SSO) مع مصادقة متعددة العوامل (MFA) لتسجيل الدخول الآمن. التحكم في الوصول المستند إلى الدور (RBAC) لضمان وصول المستخدمين إلى مجموعات البيانات المسموح بها فقط. تتم استضافة جميع البيانات في مراكز البيانات السيادية في الإمارات العربية المتحدة للحفاظ على الإقامة والسيادة. آليات التشفير للبيانات في وضع السكون وأثناء النقل. المراقبة المستمرة للكشف عن الوصول غير المصرح به ومنعه. يتم تسجيل كل مطلب واستجابة وإجراء في النظام؛ ويتحقق الموظفون المصرح لهم من السجلات بحثاً عن التحيز وسوء الاستخدام والحالات الأمنية الشاذة. إعادة استخدام مدخلات المستخدم فقط في ظل السرية التامة لتحسين النماذج، وليس للإعلان أو التنميط."
	},
	"data_sharing": {
		"title": "مشاركة البيانات ووصول الجهات الخارجية",
		"content": "لا تتم مشاركة بيانات المستخدم مع أطراف ثالثة إلا في الحالات التي تقتضيها لوائح حكومة أبوظبي قانوناً. يجب أن يلتزم المستخدمون باتفاقيات مشاركة البيانات المحددة داخل GovGPT. قد تعرض GovGPT على السطح ارتباطات تشعبية لمواقع إلكترونية خارجية أو محتوى طرف ثالث (على سبيل المثال، صفحات الويب العامة). نحن لا نتحكم في محتوى الطرف الثالث أو ممارسات معالجة البيانات الخاصة به. ننصح جميع المستخدمين بالرجوع إلى سياسة الخصوصية الخاصة بكل موقع خارجي قبل تقديم البيانات الشخصية."
	},
	"data_retention": {
		"title": "الاحتفاظ بالبيانات والامتثال",
		"content": "يتم تخزين جميع البيانات الشخصية ومعالجتها داخل بنية تحتية مستضافة في الإمارات العربية المتحدة، بما يتوافق مع قوانين إقامة البيانات. تعكس الممارسات الأمنية تلك المطبقة على منصة الويب وتحكمها بروتوكولات الأمن السيبراني الخاصة بـ DGE. فترات الاحتفاظ: يتم تخزين البيانات وفقاً لفترة الاحتفاظ بالبيانات وفقاً لتكليف حكومة أبوظبي؛ ذاكرة الجلسة والذاكرة طويلة الأجل لمدة ثلاث سنوات، وسجلات التدقيق لمدة ثلاث سنوات (تخضع للملحق النهائي للأمن السيبراني)، والملفات التي تم تحميلها لمدة أقصاها 180 يوماً أو عند حذف المستخدم. تلتزم GovGPT بلوائح حماية البيانات ومشاركة البيانات وخصوصية البيانات المطبقة على الجهات الحكومية في أبوظبي."
	},
	"breach_notification": {
		"title": "الإخطار بالاختراق",
		"content": "في حالة حدوث خرق للبيانات: سيتم إخطار المستخدمين في غضون الإطار الزمني المحدد قانوناً. سيتلقى أصحاب البيانات المتأثرون تفاصيل عن طبيعة الاختراق والإجراءات الأمنية الموصى بها. ستقوم فرق الأمن بالتحقيق وتنفيذ الإجراءات التصحيحية."
	},
	"cookie_policy": {
		"title": "سياسة ملفات تعريف الارتباط",
		"content": "نستخدم ملفات تعريف الارتباط لتحسين تجربتك على منصتنا وتذكر تفضيلاتك وجمع التحليلات لتحسين موقعنا. يمكنك ضبط إعدادات متصفحك لحظر أو تقييد ملفات تعريف الارتباط أو تلقي تنبيهات عند استخدام ملفات تعريف الارتباط. ومع ذلك، قد يؤدي تعطيل ملفات تعريف الارتباط أو رفضها إلى تقييد الوصول إلى بعض الميزات أو التأثير على وظائف موقع GovGPT."
	},
	"external_links": {
		"title": "الروابط إلى مواقع إلكترونية أخرى",
		"content": "قد يحتوي موقع GovGPT على ارتباطات تشعبية توجه المستخدمين إلى مواقع إلكترونية خارجية أو تطبيقات طرف ثالث. لا تتحمل DGE أي مسؤولية عن الخصوصية أو الممارسات الأمنية لهذه الوجهات؛ ويتوقع من المستخدمين مراجعة إشعارات الخصوصية المعمول بها قبل الكشف عن أي معلومات شخصية."
	},
	"consent": {
		"title": "موافقة المستخدم",
		"content": "بمتابعة تسجيل الدخول واستخدام موقع GovGPT، فإنك تؤكد أنك قد قرأت وفهمت ووافقت على سياسة الخصوصية الموضحة أعلاه."
	}
} 