{
	"title": "الشروط والأحكام",
	"version": "الإصدار 1.0 - 2025 (الإصدار الأول)",
	"user_responsibilities": {
		"title": "مسؤوليات المستخدم",
		"content": "يجب على مستخدمي موقع GovGPT: تقديم معلومات شخصية دقيقة ومحدثة. استخدام البيانات بمسؤولية وبما يتوافق مع سياسات حوكمة البيانات في أبوظبي. عدم الانخراط في مشاركة البيانات أو تعديلها أو حذفها بشكل غير مصرح به. الحفاظ على سرية بيانات الاعتماد للوصول."
	},
	"user_rights": {
		"title": "حقوق المستخدم",
		"content": "يحق للمستخدمين: الوصول إلى بياناتهم أو تصحيحها وفقاً للوائح أبوظبي. تلقي إشعارات في الوقت المناسب في حالة حدوث خرق للبيانات يؤثر على معلوماتهم. يتحمل المستخدمون مسؤولية الامتثال للسياسات الأمنية وحماية بيانات اعتمادهم لمنع الوصول غير المصرح به."
	},
	"prohibited_activities": {
		"title": "الأنشطة المحظورة",
		"content": "الأنشطة التالية محظورة تماماً: الوصول غير المصرح به إلى مجموعات البيانات أو محاولة تجاوز الضوابط الأمنية. مشاركة البيانات مع كيانات غير مصرح لها. إساءة استخدام وظائف المنصة لأغراض شخصية أو غير مصرح بها. الانخراط في أنشطة تعرض سلامة المنصة للخطر. استخدام المنصة لأي أنشطة غير قانونية أو مسيئة أو غير أخلاقية تنتهك القوانين أو اللوائح أو المعايير."
	},
	"data_access": {
		"title": "الوصول إلى البيانات وتصحيحها وحذفها",
		"content": "يجب على المستخدمين الامتثال لجميع اتفاقيات مشاركة البيانات وبروتوكولات الأمان الحكومية. يجب عدم استخدام البيانات التي يتم الوصول إليها من خلال GovGPT لأغراض تجارية أو غير حكومية. أي سوء استخدام أو خرق للبيانات سيؤدي إلى الإلغاء الفوري للوصول والعواقب القانونية المحتملة. يمكن للمستخدمين طلب نسخة من معلوماتهم الشخصية أو تصحيحها. لا يُسمح بحذف البيانات لأن جميع المدخلات تنطبق عليها أحكام ملكية البيانات الخاصة بحكومة أبوظبي."
	},
	"termination": {
		"title": "إنهاء الوصول",
		"content": "يحتفظ مسؤولو GovGPT بالحق في إنهاء وصول المستخدم في حالات: عدم الامتثال لسياسات البيانات والتدابير الأمنية. اكتشاف أنشطة غير مصرح بها أو محاولات اختراق. انتهاك اللوائح التي تفرضها الحكومة."
	},
	"disclaimer": {
		"title": "إخلاء المسؤولية",
		"content": "تقدم GovGPT والسلطات الإدارية التابعة لها المنصة وخدماتها على أساس \"كما هي\"، دون أي ضمانات فيما يتعلق بدقة البيانات أو اكتمالها أو توفرها. بينما طبّقت GovGPT تدابير أمنية قوية، بما في ذلك التشفير وضوابط الوصول والمراقبة المستمرة، إلا أنها ليست مسؤولة عن الانتهاكات الأمنية أو سوء استخدام البيانات أو تعطل الخدمة الناجم عن التهديدات الخارجية أو انقطاع النظام أو سوء سلوك المستخدم. يتحمل المستخدمون مسؤولية بذل العناية الواجبة عند الوصول إلى مجموعات البيانات المشتركة واستخدامها. موقع GovGPT مخصص فقط للمستخدمين المصرح لهم من الحكومة الذين تبلغ أعمارهم 18 عاماً فما فوق. الوصول من قبل القاصرين محظور بشكل صارم ومراقبته بفعالية."
	},
	"contact": {
		"title": "كيف يمكنك الاتصال بنا؟",
		"content": "إذا كانت لديك أي أسئلة حول سياسة خصوصية GovGPT، يمكنك الاتصال بنا على support.govgpt@dge.gov.ae"
	},
	"consent": {
		"title": "موافقة المستخدم",
		"content": "بالمتابعة لتسجيل الدخول واستخدام GovGPT، فإنك تؤكد أنك قد قرأت وفهمت ووافقت على الشروط والأحكام الموضحة أعلاه."
	}
} 