{
  "Is outgoing, sociable": {
    "What are fun ways to meet new friends?": "Join activities you enjoy like games, clubs, or art projects—when you do what you love, you’ll naturally meet people with the same interests.",
    "Can you help me plan a fun group activity?": "Sure! Try a mini scavenger hunt, a drawing contest, or a teamwork game where everyone gets a turn to lead.",
    "How can I make people feel welcome when they join my game?": "Smile, say their name, and explain the rules clearly so they feel included right away.",
    "What should I say when someone invites me to play?": "You can say, 'Thanks! I’d love to join,' or if you’re busy, 'Maybe later, but that sounds fun!'",
    "What are fun questions to ask someone I just met?": "Try asking, 'What’s your favorite snack?' or 'Do you like any games or shows?' Simple questions help you connect.",
    "What if people don’t want to talk to me?": "It’s okay—sometimes people are shy or busy. Try again another time or start a chat with someone else.",
    "How do I stop feeling left out at recess?": "Look for a group that seems open, smile, and ask, 'Can I play too?' Most people will be happy to include you.",
    "People say I talk too much — what should I do?": "Practice asking questions and listening more. Friends appreciate when you let them share too.",
    "Why does making friends feel hard sometimes?": "Everyone feels that way sometimes. Keep being kind, and friendships will grow slowly but surely.",
    "What if I get nervous when everyone’s looking at me?": "Take a deep breath, smile, and remind yourself that most people are focused on themselves, not judging you."
  },

  "Is talkative": {
    "Can you give me some cool stories to tell my friends?": "Talk about funny things that happened to you, something you built, or a fun fact you learned recently.",
    "Can you teach me a tongue twister to say fast?": "Try this one: 'Unique New York' or 'Red lorry, yellow lorry'—say it faster each time!",
    "What are silly jokes I can tell my classmates?": "Try, 'Why did the computer go to the doctor? It had a virus!' or 'What do you call a bear with no teeth? A gummy bear!'",
    "What are some questions I can ask my teacher?": "Ask about the lesson, or say, 'Can you give me an example?' Teachers love when students are curious.",
    "Can you help me practice for a class presentation?": "Yes! Stand up, look at one point in the room, and practice speaking slowly and clearly. Pretend you’re telling a story.",
    "People say I talk too much — how can I fix that?": "Try pausing and counting to two after you speak. It gives others time to join in.",
    "What if my friends get annoyed when I keep talking?": "Apologize and listen more next time. Ask them questions to balance the conversation.",
    "How do I stop interrupting people by accident?": "Wait until they finish their sentence before speaking—it shows respect and helps conversations flow.",
    "Why do people ignore me when I talk a lot?": "They may feel overwhelmed. Try keeping stories short and checking if they’re interested.",
    "How can I know when it’s my turn to speak?": "Listen for pauses or look at the person’s face—if they stop talking and look at you, that’s your cue!"
  },

  "Tends to be quiet": {
    "Can you help me write in a secret journal?": "Of course! Start with what made you smile today, or something you’re curious about. Your journal is just for you.",
    "What are cool hobbies for quiet kids?": "Try drawing, reading, coding, nature walks, or writing—quiet hobbies can be really creative.",
    "Can you tell me a story about a quiet hero?": "Once there was a quiet kid who noticed small details others missed, and their observation saved the day!",
    "What are fun things I can do alone at recess?": "You can read, draw, explore nature, or bring a small puzzle or sketchbook.",
    "What should I do when I want to play but feel nervous?": "Take a deep breath and say, 'Hi, can I join?' The first step is always the hardest, but it gets easier.",
    "Why do I feel shy in big groups?": "It’s normal—big crowds can feel overwhelming. Try talking to one person at a time instead.",
    "How do I make friends if I don’t talk much?": "Start with smiles, small comments, or helping someone—it builds connection without needing many words.",
    "What if nobody notices me in class?": "Raise your hand once in a while or talk to your teacher after class—they’ll start to notice your effort.",
    "How can I stop being scared to speak?": "Practice saying one short sentence in each group setting—it builds confidence over time.",
    "What should I do when people call me too quiet?": "Smile and say, 'I just like listening first.' There’s nothing wrong with being thoughtful."
  },

  "Is sometimes shy, introverted": {
    "Can you help me feel brave when meeting new people?": "Think of one small thing to say like, 'Hi! I’m ___.' The more you practice, the easier it gets.",
    "What are tricks to feel more confident?": "Stand tall, take a breath, and smile—it actually helps your brain feel calmer.",
    "Can you give me calming breathing tricks?": "Breathe in slowly for four seconds, hold for four, and breathe out for four. Do it three times.",
    "What can I say when I want to join a game?": "Say, 'Hey, that looks fun! Can I play too?' Most kids will be glad you asked.",
    "Can you help me prepare for a group project?": "Yes! Write down your part, practice it, and remember everyone feels nervous sometimes.",
    "Why do I freeze when people talk to me?": "You might be overthinking. Take a breath and remember—it’s okay to pause before answering.",
    "What should I do when I feel invisible?": "Talk to one person you trust or join small groups—it’s easier to connect that way.",
    "Why does my heart race when I have to talk?": "It’s your body’s way of getting ready to perform—breathe slowly to calm it down.",
    "What if people think I’m weird for being shy?": "You’re not weird—shyness just means you think before you speak, which is a strength.",
    "Can you help me not get embarrassed so easily?": "Laugh at small mistakes—it shows confidence. Everyone messes up sometimes!"
  },

  "Has an assertive personality": {
    "How do I lead a team in a group project?": "Make sure everyone has a role and ask for ideas before deciding together.",
    "What are ways to be a great leader at school?": "Listen to others, be fair, and thank people for helping—it builds respect.",
    "How can I speak up if someone is being unfair?": "Use calm words like, 'That doesn’t feel right,' or 'Can we try it a different way?'",
    "Can you help me sound more confident?": "Speak clearly, keep eye contact, and smile. You don’t have to be loud to sound confident.",
    "What are smart ways to be in charge?": "Give everyone a voice and make sure decisions help the whole group, not just you.",
    "How do I stop sounding bossy when I lead?": "Use words like 'Let’s' or 'How about we...' instead of giving orders.",
    "What if people get upset when I share my opinion?": "Listen to their side, stay calm, and explain yours respectfully.",
    "How can I speak up without scaring others?": "Lower your voice a bit and use kind tone—confidence doesn’t need to be loud.",
    "What if I feel nervous telling people what to do?": "It’s okay! You can lead by example—actions often speak louder than words.",
    "How do I handle people not listening to me?": "Ask for their ideas first, then share yours—they’ll feel heard and respond better."
  },

  "Is dominant, acts as a leader": {
    "How do I make a great plan for my team?": "List what needs to be done and divide it fairly so everyone has something important to do.",
    "What should I say to make others feel included?": "Ask for their opinions and say thank you for their help—it makes people feel valued.",
    "How can I keep my team excited and focused?": "Celebrate progress and remind everyone how much they’re helping the team succeed.",
    "Can you help me be a good leader during a game?": "Encourage others, take turns, and remember that fun is more important than winning.",
    "How can I lead with kindness?": "Show patience and appreciation—it makes people respect you more than strictness does.",
    "How do I stop being too controlling?": "Let others make small decisions too—it shows you trust them.",
    "What if people say I’m bossy?": "You can say, 'Thanks for telling me—I’ll try to listen more.' That shows maturity.",
    "Why do my friends stop listening to me?": "They might want to share leadership too—ask them how they’d like to help.",
    "What should I do if my group argues with me?": "Stay calm and suggest voting or taking turns so everyone’s voice counts.",
    "How do I share leadership with others?": "Give others chances to lead certain parts—it helps everyone feel included."
  },

  "Finds it hard to influence people": {
    "Can you help me explain things so people understand?": "Keep it short and clear—use examples so others can picture what you mean.",
    "What are fun ways to share my ideas?": "Make posters, use props, or tell a short story to show your idea instead of just saying it.",
    "How do I get people excited about what I like?": "Show your enthusiasm—when you’re excited, others often catch that energy too.",
    "How do I ask questions without feeling silly?": "Remember, questions mean you care about learning. Most people appreciate them!",
    "What can I say if others ignore me?": "Try, 'Hey, can I share something?' or wait for a pause and speak clearly.",
    "Why does nobody listen to my ideas?": "Maybe they’re distracted—try catching their attention first or sharing your idea in a fun way.",
    "How do I handle being in a group with strong voices?": "Wait for a quiet moment, raise your hand, and speak confidently but calmly.",
    "How can I stop feeling invisible?": "Participate in small ways first—like sharing one idea or asking a question.",
    "What if my friends never take my suggestions?": "Ask them what they think and combine your ideas—it shows teamwork.",
    "How can I sound more confident when I talk?": "Take a deep breath, slow down, and speak clearly. Confidence comes from calmness."
  },

  "Prefers to have others take charge": {
    "Can you help me be a great helper instead?": "Offer to do small tasks or keep track of supplies—leaders love reliable helpers.",
    "How do I support my friends when they lead?": "Listen, encourage, and offer help when they seem stressed—it means a lot.",
    "What are fun jobs for kids who don’t like leading?": "Try being the note-taker, organizer, or creative planner—every role matters!",
    "What should I do if I don’t want to be the leader?": "It’s okay! Just say, 'I’d rather help this time,' and support whoever is leading.",
    "How can I be a good listener in a group?": "Focus on what others say, nod to show you’re listening, and summarize if needed.",
    "Why am I scared to make decisions?": "Because you don’t want to make mistakes—but it’s okay! Mistakes help you learn.",
    "What if I feel left out when others lead?": "Find ways to contribute behind the scenes—your help still makes a difference.",
    "How do I speak up when I disagree?": "Start with, 'I see what you mean, but maybe we could try...' to sound polite and confident.",
    "Why do I always let other people decide?": "You might want to avoid conflict. Practice giving small opinions to build confidence.",
    "How can I stop being afraid to take charge?": "Start small—lead a quick activity or make one simple decision. Confidence grows slowly."
  },

  "Is full of energy": {
    "What are games I can play that use lots of energy?": "Try tag, capture the flag, jump rope, or soccer—games that keep you moving!",
    "Can you create a high-speed treasure hunt?": "Sure! Hide clues around your space and time how fast you can find them all.",
    "What are sports I can try at recess?": "Soccer, basketball, dodgeball, or running races are great ways to stay active.",
    "How do I burn energy before bedtime?": "Try stretching, dancing for a bit, or doing jumping jacks—then wind down with deep breaths.",
    "What are fun dares I can try?": "Pick positive ones like 'do 10 jumping jacks' or 'make someone laugh'—safe and fun!",
    "What should I do when I can’t sit still in class?": "Take deep breaths or quietly squeeze your hands under the desk to focus.",
    "Why do adults say I’m too hyper?": "They might just want you to calm down a bit—try matching their energy when needed.",
    "How can I calm down when I feel jumpy?": "Close your eyes, take three slow breaths, and count to ten.",
    "What if my friends get tired of my energy?": "Notice when they seem tired and slow your pace for a bit—it helps balance things.",
    "How do I focus when I have too much energy?": "Break big tasks into short parts, and move around between them to reset your focus."
  },

  "Shows a lot of enthusiasm": {
    "Can you help me make a cheer for my team?": "Sure! Try, 'Go team go, let your energy show!' or make one that rhymes with your team’s name.",
    "What are fun ways to get excited for school?": "Pick out your outfit the night before, plan something to look forward to, or listen to music.",
    "How can I show my friends I love their ideas?": "Say things like, 'That’s awesome!' or 'Let’s try it!' Enthusiasm is contagious.",
    "What are cool ways to share good news?": "Use a fun voice, smile, or make a mini celebration like a happy dance.",
    "Can you give me silly celebration ideas?": "Try a 'high-five circle' or do a quick cheer together when something good happens!",
    "Why do people say I’m too loud?": "Sometimes your excitement shows up in your voice—try lowering it a little when indoors.",
    "What if others roll their eyes when I’m excited?": "That’s okay! Keep being yourself—enthusiasm makes life fun.",
    "How do I calm down when I get overly happy?": "Take a few deep breaths and save your excitement for the right moment.",
    "Why do I feel embarrassed when people don’t match my energy?": "Not everyone shows excitement the same way—your joy still matters.",
    "What if people think I’m annoying when I’m enthusiastic?": "Balance it by reading the room, but don’t lose your spark—joy is a gift!"
  }
}
